### Importar Librerias

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Importar archivo .CSV

In [3]:
salarios = pd.read_csv("./data/linkedin-jobs-usa.csv")

In [5]:
salarios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

### Tratamiento de duplicados

In [6]:
salarios.drop_duplicates()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [13]:
salarios_limpieza = salarios.copy()

In [ ]:
salarios_limpieza.duplicates()

In [9]:
salarios_limpieza.duplicated().sum()

np.int64(0)

In [10]:
salarios[salarios_limpieza.duplicated()]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary, location, criteria, posted_date, link]
Index: []

In [11]:
salarios_limpieza = salarios_limpieza.drop_duplicates

## Tratamiento de valores nulos

### Visualizar los valores nulos

In [ ]:
print(f"Valores NaN por Culumna {salarios_limpieza.isna().sum}")

Valores NaN por Culumna title               0
company             0
description         0
onsite_remote       0
salary           1916
location            0
criteria            0
posted_date         0
link                0
dtype: int64

In [18]:
# Eliminar filas que contiene al menos un valor nulo
# Que elimina toda la fila y podemos perder datos importantes

df_sin_nulos = salarios.dropna()

# Eliminar columnas que contiene al menos un valor nulo
df_sin_nulos_columnas = salarios.dropna(axis=1)

In [19]:
df_sin_nulos.isna().sum()

title            0
company          0
description      0
onsite_remote    0
salary           0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [21]:
df_sin_nulos.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"$50,000.00\r\n -\r\n $55...","Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...

In [22]:
df_sin_nulos['salary'].head()

8     $100,000.00\r\n            -\r\n            $1...
24    $50,000.00\r\n            -\r\n            $55...
35    $100,000.00\r\n            -\r\n            $1...
61    $100,000.00\r\n            -\r\n            $1...
88    $100,000.00\r\n            -\r\n            $1...
Name: salary, dtype: object

In [17]:
df_sin_nulos.shape

(929, 9)

### Axis=0 revisa fila horizontal

### Axix=1 revisa por columna vertical

### Any = Elimina si existe por lo menos un NaN

### All = Elimina si todos son NaN

In [ ]:
df_sin_nulos_columnas = salarios.dropna(axis=1, how='All')

df_sin_nulos_columnas = salarios.dropna(axis=0, how='any')

# Transformacion de datos

## 2da opcion: Remplazar NaNs por la media

#### Parsing ("Parseo") de la columna Salary

In [ ]:
df_sin_nulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

## Este cÃ³digo toma una columna 'salary' que contiene valores de salario en formato de cadena, 
## elimina cualquier caracter no numÃ©rico, extrae los dÃ­gitos y convierte la columna resultante en valores numÃ©ricos de tipo float. 
El resultado se almacena en una nueva columna llamada 'salary_numeric'. 
Esto es Ãºtil cuando la columna 'salary' inicial contiene caracteres no numÃ©ricos y se desea trabajar con los salarios como valores numÃ©ricos.

In [24]:
df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

C:\Users\Bruno\AppData\Local\Temp\ipykernel_13812\3084583614.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

In [28]:
import re

# Extrae el primer nÃºmero vÃ¡lido (entero o decimal) de cada celda y lo convierte a float
df_sin_nulos['salary_numeric'].dtype

dtype('float64')